DataProcessors/НастроечныеТаблицыXMLвУчетнойПолитике.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>НастроечныеТаблицыXMLвУчетнойПолитике</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РегистрСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Измерение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИменаXMLЭлементов</Name>
					<Comment>Нулевой элемент содержит имя xml-элемента, обозначающего ряд, первый элемент - имя xml-элемента, обозначающего колонку 1 и т.д</Comment>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЗ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Колонка1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка7</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка8</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка9</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Колонка10</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/НастроечныеТаблицыXMLвУчетнойПолитике/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.РегистрСведений) Тогда
		ЭтаФорма.Объект.РегистрСведений = ЭтаФорма.Параметры.РегистрСведений;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Измерение) Тогда
		ЭтаФорма.Объект.Измерение = ЭтаФорма.Параметры.Измерение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.Ресурс) Тогда
		ЭтаФорма.Объект.Ресурс = ЭтаФорма.Параметры.Ресурс;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтаФорма.Параметры.ЗначениеИзмерения) Тогда
		ЭтаФорма.Объект.ЗначениеИзмерения = ЭтаФорма.Параметры.ЗначениеИзмерения;
		
		//Если при вызове формы параметры заполнены, значит она вызвана не напрямую,
		// т.е. не предполагает изменение этих настроек, поэтому скроем все закладки, кроме "СтрДанные"
		
		ЭтаФорма.Элементы.СтрПараметрыТаблицы.Видимость = Ложь;
		ЭтаФорма.Элементы.СтрОтладкаСкрыть.Видимость	=Ложь;
	КонецЕсли;
	
	//Установи настройки по умолчанию
	//------------------------------------
	Об = РеквизитФормыВЗначение("Объект");                        
	Об.УстановитьНастройки();
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполниТаблицу()
КонецПроцедуры


&НаСервере
Процедура ПрочитайСписокКолонокXMLиДанные()
	Об 		= РеквизитФормыВЗначение("Объект");
	
	Текст 	=  Об.ПолучиТекст();
	Об.Текст = Текст;
	
	Об.ЗаполниСписокXMLэлементовОписывающихСтруктуруТаблицы(Текст, Об.ИменаXMLЭлементов, 10);
	
	Об.Прочитать(Текст);
	

	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполниТаблицу(Команда=Неопределено)
	ПрочитайСписокКолонокXMLиДанные();
	
	// Вместо заголовков колонок "Колонка1", "Колонка" используй имена колонок из xml
	//--------------------------------------------------------------------------------
	Для Каждого Элем Из ЭтаФорма.Элементы Цикл
		
		Если Элем.Родитель=ЭтаФорма Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Элем) <> Тип("ПолеФормы") Тогда
			Продолжить;
		КонецЕсли;
			
		Если СтрНайти(Элем.Имя, "ТЗКолонка")=0 Тогда 
			Продолжить;
		КонецЕсли;
		Если СтрНайти(Элем.Имя, "КонтекстноеМеню")>0 Тогда 
			Продолжить;
		КонецЕсли;

		
		НомерКолонки=Число(Прав(Элем.Имя, СтрДлина(Элем.Имя)-СтрДлина("ТЗКолонка")));
		xmlИмяКолонки = ЭтаФорма.Объект.ИменаXMLЭлементов.Получить(НомерКолонки).Значение;
		Если xmlИмяКолонки = "" Тогда
			Элем.Видимость = Ложь;
		Иначе
			Элем.Заголовок = xmlИмяКолонки;
		КонецЕсли;
	КонецЦикла;
	
	//В качестве заголовка закладки отобрази имя настроечной таблицы
	//---------------------------------------------------------------
	ЭтаФорма.Элементы["СтрДанные"].Заголовок ="Таблица: "+ ЭтаФорма.Объект.ЗначениеИзмерения;

КонецПроцедуры


&НаСервере
Процедура ЗаписатьНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
 	Об.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();	
КонецПроцедуры

&НаКлиенте
Процедура СтрцыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Имя="СтрДанные" Тогда
		ЗаполниТаблицу();
	КонецЕсли;
КонецПроцедуры
